/*

Подвиг 9 (на повторение). 

Напишите программу, которая читает из входного потока четыре целых числа a, b, c, d, 

записанных в одну строчку через пробел. 

Необходимо определить войдет ли в конверт с внутренними размерами a и b см 

прямоугольная открытка с размерами с и d см. 

Для размещения открытки в конверте необходим зазор в 0,5 см с каждой стороны. 

Вывести в консоль "yes", если входит и "no" если не входит.

Тесты: https://github.com/selfedu-rus/c-tests/tree/main/4.7.9

Sample Input:
5 10 9 3

Sample Output:
yes

https://stepik.org/lesson/1191290/step/11?unit=1204278

*/